tjd61/cc2650_simplelink_ble/ti/simplelink_academy_01_11_00_0000/modules/projects/support_files/Components/SCIF_UART/scif_framework.c
} // scifUninitIo




/** \brief Returns the index of the least significant '1' in the given bit-vector
  *
  * \param[in]      x
  *     The bit-vector
  *
  * \return
  *     The bit index of the least significant '1', e.g. 2 for 0x0004, or 32 if all bits are '0'
  */
static int scifFindLeastSignificant1(uint32_t x) {
#if defined(__IAR_SYSTEMS_ICC__) || defined(DOXYGEN)
    return __CLZ(__RBIT(x));
#elif defined(__TI_COMPILER_VERSION__) || defined(__CC_ARM)
    return __clz(__rbit(x));
#else
    return __builtin_ctz(x);
#endif
} // scifFindLeastSignificant1




/** \brief Initializes the driver
  *
  * This function must be called to enable the driver for operation. The function:
  * - Verifies that the driver is not already active
  * - Stores a local copy of the driver setup data structure, \ref SCIF_DATA_T
  * - Configures AUX domain hardware modules for operation (general and setup-specific). This includes
  *   complete I/O setup for all Sensor Controller tasks.
  * - Loads the generated AUX RAM image into the AUX RAM
  * - Initializes handshaking mechanisms for control, alert interrupt generation and data exchange
  * - Configures use of AUX domain wake-up sources
  * - Starts the Sensor Controller
  *
  * \param[in]      *pScifDriverSetup
  *     Driver setup, containing all relevant pointers and parameters for operation
  *
  * \return
  *     \ref SCIF_SUCCESS if successful, or \ref SCIF_ILLEGAL_OPERATION if the Sensor Controller already
  *     is active. The function call has no effect if unsuccessful.
  */
SCIF_RESULT_T scifInit(const SCIF_DATA_T* pScifDriverSetup) {
    uint32_t key;

    // Perform sanity checks: The Sensor Controller cannot already be active
    if (HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) & AON_WUC_AUXCTL_SCE_RUN_EN_M) {
        return SCIF_ILLEGAL_OPERATION;
    }

    // Copy the driver setup
    memcpy(&scifData, pScifDriverSetup, sizeof(SCIF_DATA_T));

    // Enable clock for required AUX modules
    HWREG(AUX_WUC_BASE + AUX_WUC_O_MODCLKEN0) = AUX_WUC_MODCLKEN0_SMPH_M |
                                                AUX_WUC_MODCLKEN0_AIODIO0_M |
                                                AUX_WUC_MODCLKEN0_AIODIO1_M |
                                                AUX_WUC_MODCLKEN0_TIMER_M |
                                                AUX_WUC_MODCLKEN0_ANAIF_M |
                                                AUX_WUC_MODCLKEN0_TDC_M |
                                                AUX_WUC_MODCLKEN0_AUX_DDI0_OSC_M |
                                                AUX_WUC_MODCLKEN0_AUX_ADI4_M;

    // Open the AUX I/O latches, which have undefined value after power-up. AUX_AIODIO will by default
    // drive '0' on all I/O pins, so AUX_AIODIO must be configured before IOC
    HWREG(AUX_WUC_BASE + AUX_WUC_O_AUXIOLATCH) = AUX_WUC_AUXIOLATCH_EN_TRANSP;

    // Upload the AUX RAM image
    memcpy((void*) AUX_RAM_BASE, scifData.pAuxRamImage, scifData.auxRamImageSize);

    // Perform task resource initialization
    scifData.fptrTaskResourceInit();

    // Map events to the Sensor Controller's vector table, and set reset vector = AON wakeup
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_VECCFG0) = AUX_EVCTL_VECCFG0_VEC0_EV_AON_SW      | AUX_EVCTL_VECCFG0_VEC0_EN_M |
                                                  AUX_EVCTL_VECCFG0_VEC1_EV_AON_RTC_CH2 | AUX_EVCTL_VECCFG0_VEC1_EN_M;
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_VECCFG1) = AUX_EVCTL_VECCFG1_VEC2_EV_AON_SW      |
                                                  AUX_EVCTL_VECCFG1_VEC3_EV_AON_SW      | AUX_EVCTL_VECCFG1_VEC3_EN_M;
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL) = 1 << AUX_SCE_CTL_RESET_VECTOR_S;

    // Clear any vector flags currently set (due to previous hardware or SCIF driver operation)
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_VECFLAGS) = 0x0000;

    // Set the READY event
    HWREG(AUX_EVCTL_BASE + AUX_EVCTL_O_SWEVSET) = AUX_EVCTL_SWEVSET_SWEV0_M;

    // Let AUX be powered down (clocks disabled, full retention) and the bus connection between the AUX
    // and MCU domains be disconnected by default. This may have been done already by the operating
    // system to be able to avoid framework dependencies on whether or not the Sensor Controller is used.
    HWREG(AUX_WUC_BASE + AUX_WUC_O_PWRDWNREQ) = 1;
    HWREG(AUX_WUC_BASE + AUX_WUC_O_MCUBUSCTL) = AUX_WUC_MCUBUSCTL_DISCONNECT_REQ;

    // Start the Sensor Controller, but first read a random register from the AUX domain to ensure
    // that the last write accesses have been completed
    HWREG(AUX_WUC_BASE + AUX_WUC_O_MCUBUSCTL);
    key = scifOsalEnterCriticalSection();
    HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) |= AON_WUC_AUXCTL_SCE_RUN_EN_M;

    // The System CPU shall wake up on the ALERT event
    HWREG(AON_EVENT_BASE + AON_EVENT_O_MCUWUSEL) =
        (HWREG(AON_EVENT_BASE + AON_EVENT_O_MCUWUSEL) & ~(AON_EVENT_MCUWUSEL_WU0_EV_M << OSAL_MCUWUSEL_WU_EV_S)) |
        (AON_EVENT_MCUWUSEL_WU0_EV_AUX_SWEV1 << OSAL_MCUWUSEL_WU_EV_S);
    scifOsalLeaveCriticalSection(key);
    HWREG(AON_RTC_BASE + AON_RTC_O_SYNC);

    // Register and enable the interrupts. If warm, we probably have task ALERT event(s) pending, which
    // will be triggered immediately. We need to clear the interrupts because they might have been used
    // previously
    osalRegisterCtrlReadyInt();
    osalClearCtrlReadyInt();
    osalEnableCtrlReadyInt();
    osalRegisterTaskAlertInt();
    osalClearTaskAlertInt();
    osalEnableTaskAlertInt();

    return SCIF_SUCCESS;

} // scifInit




/** \brief Uninitializes the driver in order to release hardware resources or switch to another driver
  *
  * All Sensor Controller tasks must have been stopped before calling this function, to avoid leaving
  * hardware modules used in an unknown state. Also, any tick generation must have been stopped to avoid
  * leaving handshaking with the tick source in an unknown state.
  *
  * This function will wait until the Sensor Controller is sleeping before shutting it down.
  */
void scifUninit(void) {
    uint32_t key;

    // Wait until the Sensor Controller is idle (it might still be running, though not for long)
    while (!(HWREG(AUX_SCE_BASE + AUX_SCE_O_CPUSTAT) & AUX_SCE_CPUSTAT_SLEEP_M));

    // Stop and reset the Sensor Controller Engine
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL) = AUX_SCE_CTL_RESTART_M;
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL) = AUX_SCE_CTL_RESTART_M | AUX_SCE_CTL_SUSPEND_M;
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL);
    key = scifOsalEnterCriticalSection();
    HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) &= ~AON_WUC_AUXCTL_SCE_RUN_EN_M;
    scifOsalLeaveCriticalSection(key);
    HWREG(AON_RTC_BASE + AON_RTC_O_SYNC);
    HWREG(AUX_SCE_BASE + AUX_SCE_O_CTL) = 0x0000;

    // Disable interrupts
    osalDisableCtrlReadyInt();
    osalDisableTaskAlertInt();

